[
  "Give your garden one long weekly soak (about an inch of water) - Short, frequent waterings won't penetrate to the roots.",
  "And avoid watering during the hottest part of the day - Unless you want to burn your plants. (Shoot for morning or dusk instead.) ",
  "If transporting plants, do so after a rainfall - Damp soil will keep the roots from cracking.",
  "\"Insulate\" your home with shrubs and bushes - Planting strategically along your facade can create a natural wind barrier...and save you money on heating costs. ",
  "Be careful not to overmow your grass - Never cut shorter than two inches: It'll weaken the grass and make your lawn susceptible to weeds. ",
  "Assess how much sunlight your blooms will get before you plant them - Most plants need six hours of sun to thrive.",
  "Prune spring trees (like lilac and magnolia) right after they finish blooming - If you wait too long, you'll dissuade next year's buds.",
  "Keep herbs separate from other plantings - Mint, in particular, is highly invasive. ",
  "Strip lower leaves on vegetable plants regularly - This will prevent fungal diseases from encroaching. ",
  "Stake your tall perennials (like peonies and hollyhocks) early - It's pretty hard to do so once they've taken off.",
  "And a reminder on perennials: They need three years to mature - Practice patience and you'll reap the rewards, people.",
  "Deadhead your flowering plants vigilantly - Remove wilted blooms to tell your plant to make more of 'em.  ",
  "Improve your soil by working in a few inches of compost - Manure and peat moss work great too.",
  "Tackle spring plantings on cloudy days - New plants take best to cool soil.",
  "Use broth from cooking veggies to water your plants - \"Veggie soup\" is the best plant food.  ",
  "Broken terra-cotta pots? Place their shards around plants like so - This will keep critters from tearing up your geraniums. ",
  "And edge your flowerbeds with rocks - To help discourage grasses and weeds from taking over.",
  "Line container gardens with a thin layer of gravel - Proper drainage is key here, people.",
  "Plant blooming herbs to attract butterflies - Like lavender and beebalm.",
  "But make sure you have evergreens like boxwood and heath too - You want your garden to look good in every season, right?",
  "Holes for bulbs should be two to three times as deep as the bulb itself - They need room to grow, after all. ",
  "Wear gardening gloves - Those rose bushes are no match for your protected paws.",
  "Run your fingernails across a bar of soap - Gardener hack: This will seal off dirt from accumulating under your nails.",
  "Don't jump the gun and plant too early in the season - Check your local last \"frost dates\" here. (Hint: It's mid-May in the Northeast.)",
  "Check your local last \"frost dates\". (Hint: It's mid-May in the Northeast.)",
  "Add a tiny bit of fertilizer to water for new plants - It's like giving a toddler milk for strong bones."
]
